{"keras_version": "1.2.1", "config": [{"config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u000eredis_model.py\u00da\b<lambda>j\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "trainable": true, "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "activation": "elu", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 24, "name": "convolution2d_1", "b_regularizer": null, "nb_row": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "activation": "elu", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 36, "name": "convolution2d_2", "b_regularizer": null, "nb_row": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "activation": "elu", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 48, "name": "convolution2d_3", "b_regularizer": null, "nb_row": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "activation": "elu", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 64, "name": "convolution2d_4", "b_regularizer": null, "nb_row": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "activation": "elu", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 64, "name": "convolution2d_5", "b_regularizer": null, "nb_row": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.4, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"batch_input_shape": [null, 588800], "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 588800, "input_dtype": "float32", "output_dim": 100, "activation": "elu", "trainable": true, "W_constraint": null, "bias": true, "name": "dense_1", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 100], "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 100, "input_dtype": "float32", "output_dim": 50, "activation": "elu", "trainable": true, "W_constraint": null, "bias": true, "name": "dense_2", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 50], "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 50, "input_dtype": "float32", "output_dim": 10, "activation": "linear", "trainable": true, "W_constraint": null, "bias": true, "name": "dense_3", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 10], "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 10, "input_dtype": "float32", "output_dim": 1, "activation": "linear", "trainable": true, "W_constraint": null, "bias": true, "name": "dense_4", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}